restaurant_app_api/app/controllers/eateries_controller.rb

  def index
    @eateries = Eatery.all
---
SELECT "eateries".* FROM "eateries" WHERE (city_id = #{params[:city_id]})

    def set_eatery
      @eatery = Eatery.find(params[:id])
---
SELECT "eateries".* FROM "eateries" WHERE "eateries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]